# Q01

In [9]:
##
## Imprima la cantidad de registros por cada letra 
## de la columna _c1 de la tabla tbl0
##

In [8]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [2]:
tbl0.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [7]:
q01 = tbl0.groupby('_c1').count()['_c0']
print(q01)

_c1
A     8
B     7
C     5
D     6
E    14
Name: _c0, dtype: int64

In [10]:
%run q01.py

_c1
A     8
B     7
C     5
D     6
E    14
Name: _c0, dtype: int64

# Q02

In [11]:
##
## Imprima el promedio de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [12]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [16]:
q02 = tbl0.groupby('_c1').mean()['_c2']

In [17]:
print(q02)

_c1
A    4.625000
B    5.142857
C    5.400000
D    3.833333
E    4.785714
Name: _c2, dtype: float64

In [19]:
%run q02.py

_c1
A    4.625000
B    5.142857
C    5.400000
D    3.833333
E    4.785714
Name: _c2, dtype: float64

# Q03

In [20]:
##
## Imprima el maximo de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [24]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [25]:
q03 = tbl0.groupby('_c1').max()['_c2']
print(q03)

_c1
A    9
B    9
C    9
D    7
E    9
Name: _c2, dtype: int64

In [26]:
%run q03.py

_c1
A    9
B    9
C    9
D    7
E    9
Name: _c2, dtype: int64

# Q04

In [27]:
##
## Imprima los valores unicos e la columna _c4 de 
## de la tabla tbl1 en mayusculas
##

In [68]:
import pandas
tbl1 = pandas.read_csv('tbl1.tsv', sep = '\t')

In [73]:
tbl11 = tbl1.copy()

In [74]:
tbl11.head()

   _c0 _c4
0    0   b
1    0   g
2    0   f
3    1   a
4    1   f

In [75]:
unique = tbl11['_c4'].unique()

In [76]:
unique1 = sorted(unique)

In [80]:
unique2 = [n.upper() for n in unique1]

In [81]:
print(unique2)

['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [82]:
%run q04.py

['A', 'B', 'C', 'D', 'E', 'F', 'G']

# Q05

In [ ]:
## Imprima la suma de la _c2 por cada letra de la _c1 
## de la tabla tbl0

In [83]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
q05 = tbl0.groupby('_c1').sum()['_c2']
print(q05)

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

In [84]:
%run q05.py

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

# Q06

In [ ]:
##
## Imprima la suma de la _c2 por cada letra de la _c1 
## de la tabla tbl0
##

In [85]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
q06 = tbl0.groupby('_c1').sum()['_c2']
print(q06)

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

In [87]:
%run q06.py

_c1
A    37
B    36
C    27
D    23
E    67
Name: _c2, dtype: int64

# Q07

In [ ]:
##
## Agregue una columna  con la suma de _c0 y _c2 a la tabla tbl0.tsv 
##

In [88]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')

In [89]:
tbl0aux = tbl0.copy()

In [91]:
tbl0aux['suma'] = tbl0aux['_c0'] + tbl0aux['_c2']

In [92]:
print(tbl0aux)

    _c0 _c1  _c2         _c3  suma
0     0   E    1  1999-02-28     1
1     1   A    2  1999-10-28     3
2     2   B    5  1998-05-02     7
3     3   A    3  1999-08-28     6
4     4   C    6  1999-12-01    10
5     5   A    7  1998-07-28    12
6     6   A    9  1997-02-28    15
7     7   B    1  1999-05-10     8
8     8   E    2  1997-04-12    10
9     9   B    3  1999-11-23    12
10   10   C    7  1998-01-17    17
11   11   C    5  1998-12-28    16
12   12   D    3  1999-10-15    15
13   13   E    8  1998-11-01    21
14   14   B    9  1999-08-12    23
15   15   D    1  1997-12-01    16
16   16   E    3  1997-07-28    19
17   17   D    5  1998-08-12    22
18   18   E    8  1999-08-24    26
19   19   E    9  1998-01-23    28
20   20   E    7  1999-06-22    27
21   21   E    3  1999-04-24    24
22   22   D    5  1999-06-25    27
23   23   A    1  1999-08-25    24
24   24   E    4  1997-07-26    28
25   25   E    6  1997-09-24    31
26   26   A    8  1997-09-28    34
27   27   E    5  1999-06-22    32
28   28   A    6  1999-07-29    34
29   29   C    0  1999-08-22    29
30   30   A    1  1998-04-26    31
31   31   D    2  1998-02-24    33
32   32   E    5  1999-03-24    37
33   33   B    4  1998-03-23    37
34   34   B    6  1999-04-21    40
35   35   D    7  1999-02-29    42
36   36   B    8  1997-05-21    44
37   37   C    9  1997-07-22    46
38   38   E    1  1999-09-28    39
39   39   E    5  1998-01-26    44

In [93]:
%run q07.py

    _c0 _c1  _c2         _c3  suma
0     0   E    1  1999-02-28     1
1     1   A    2  1999-10-28     3
2     2   B    5  1998-05-02     7
3     3   A    3  1999-08-28     6
4     4   C    6  1999-12-01    10
5     5   A    7  1998-07-28    12
6     6   A    9  1997-02-28    15
7     7   B    1  1999-05-10     8
8     8   E    2  1997-04-12    10
9     9   B    3  1999-11-23    12
10   10   C    7  1998-01-17    17
11   11   C    5  1998-12-28    16
12   12   D    3  1999-10-15    15
13   13   E    8  1998-11-01    21
14   14   B    9  1999-08-12    23
15   15   D    1  1997-12-01    16
16   16   E    3  1997-07-28    19
17   17   D    5  1998-08-12    22
18   18   E    8  1999-08-24    26
19   19   E    9  1998-01-23    28
20   20   E    7  1999-06-22    27
21   21   E    3  1999-04-24    24
22   22   D    5  1999-06-25    27
23   23   A    1  1999-08-25    24
24   24   E    4  1997-07-26    28
25   25   E    6  1997-09-24    31
26   26   A    8  1997-09-28    34
27   27   E    5  1999-06-22    32
28   28   A    6  1999-07-29    34
29   29   C    0  1999-08-22    29
30   30   A    1  1998-04-26    31
31   31   D    2  1998-02-24    33
32   32   E    5  1999-03-24    37
33   33   B    4  1998-03-23    37
34   34   B    6  1999-04-21    40
35   35   D    7  1999-02-29    42
36   36   B    8  1997-05-21    44
37   37   C    9  1997-07-22    46
38   38   E    1  1999-09-28    39
39   39   E    5  1998-01-26    44

# Q08

In [94]:
##
## Agregue el a√±o como una columna a la tabla tbl0.tsv 
##

In [95]:
import pandas
tbl0 = pandas.read_csv('tbl0.tsv', sep = '\t')
tbl0aux = tbl0.copy()

In [97]:
tbl0aux.head()

   _c0 _c1  _c2         _c3
0    0   E    1  1999-02-28
1    1   A    2  1999-10-28
2    2   B    5  1998-05-02
3    3   A    3  1999-08-28
4    4   C    6  1999-12-01

In [122]:
from datetime import datetime
#tbl0aux["_c3"] = pandas.to_datetime(tbl0aux["_c3"])

In [119]:
type(tbl0aux._c3)

pandas.core.series.Series